In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

Concatenate： 一般翻译为连接，串联

Combine: 一般翻译为结合，联合

### Concatenate

In [2]:
arr1 = np.arange(9).reshape(3,3)
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [3]:
arr2 = np.arange(9).reshape(3,3)
arr2

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [4]:
print (np.concatenate([arr1,arr2],axis=1))
np.concatenate([arr1,arr2]).shape

[[0 1 2 0 1 2]
 [3 4 5 3 4 5]
 [6 7 8 6 7 8]]

(6, 3)

默认是纵向连接，axis=1 控制它进行横向连接

#### 在series中使用concatenate

In [5]:
s1 = Series([1,2,3],index= ['X','Y','Z'])
s1

X    1
Y    2
Z    3
dtype: int64

In [6]:
s2 = Series([4,5],index= ['A','B'])
s2

A    4
B    5
dtype: int64

In [7]:
pd.concat([s1,s2],axis=1)

     0    1
A  NaN  4.0
B  NaN  5.0
X  1.0  NaN
Y  2.0  NaN
Z  3.0  NaN

默认直接纵向把s1和s2进行拼接。

- axis=1进行横向拼接。

In [8]:
df1 = DataFrame(np.random.rand(4,3), columns=['X','Y','Z'])
df1

          X         Y         Z
0  0.343117  0.939294  0.294435
1  0.360856  0.540588  0.040491
2  0.269168  0.847748  0.964255
3  0.623897  0.021685  0.613514

In [9]:
df2 = DataFrame(np.random.rand(3,3), columns=['X','Y','A'])
df2

          X         Y         A
0  0.229880  0.448728  0.242208
1  0.833380  0.011934  0.073157
2  0.895712  0.795601  0.298688

In [10]:
pd.concat([df1, df2])

          A         X         Y         Z
0       NaN  0.343117  0.939294  0.294435
1       NaN  0.360856  0.540588  0.040491
2       NaN  0.269168  0.847748  0.964255
3       NaN  0.623897  0.021685  0.613514
0  0.242208  0.229880  0.448728       NaN
1  0.073157  0.833380  0.011934       NaN
2  0.298688  0.895712  0.795601       NaN

会把没有的值进行填充。

### Combine

In [11]:
s1 = Series([2,np.nan,4, np.nan], index=['A','B','C','D'])
s1

A    2.0
B    NaN
C    4.0
D    NaN
dtype: float64

In [12]:
s2 = Series([1,2,3,4], index=['A','B','C','D'])
s2

A    1
B    2
C    3
D    4
dtype: int64

In [13]:
s1.combine_first(s2)

A    2.0
B    2.0
C    4.0
D    4.0
dtype: float64

使用s2去填充s1的nan值

In [14]:
df1 = DataFrame({
    'X': [1,np.nan,3, np.nan],
    'Y': [5,np.nan,7,np.nan],
    'Z': [9, np.nan, 11,np.nan]
})
df1

     X    Y     Z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [15]:
df2 = DataFrame({
    'Z': [np.nan,10,np.nan,12],
    'A': [1,2,3,4],
})
df2

   A     Z
0  1   NaN
1  2  10.0
2  3   NaN
3  4  12.0

In [16]:
df1.combine_first(df2)

     A    X    Y     Z
0  1.0  1.0  5.0   9.0
1  2.0  NaN  NaN  10.0
2  3.0  3.0  7.0  11.0
3  4.0  NaN  NaN  12.0

填充值。将df2中有的，df1中没有的填充进去